app/views/user_stories/show.html.haml

SELECT `tasks`.* FROM `tasks`  WHERE `tasks`.`user_story_id` = 1
---
		%ul
		- @user_story.tasks.each do |task|