app/views/projects/show.html.haml

SELECT `user_stories`.* FROM `user_stories`  WHERE `user_stories`.`project_id` = 1
---
%ul
	-@project.user_stories.each do |story|