app/controllers/projects_controller.rb

	def index
		@users = User.all
		@search =  Project.search(params[:q])
---
SELECT `projects`.* FROM `projects`