app/controllers/projects_controller.rb

	def index
		@projects =Project.joins(:members).where(members: {user_id: current_user.id})
---
SELECT `projects`.* FROM `projects` INNER JOIN `members` ON `members`.`project_id` = `projects`.`id` WHERE `members`.`user_id` = 2

	def edit
		@user_ids=Member.select(:user_id).where(project_id: Project.find(params[:id]))
		@users=User.where("id NOT IN (?)" , @user_ids)
---
SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 9 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1

	def create
		@project= Project.new(project_params)
		params[:user][:id].each do |user|
			if !user.empty?
				@project.members.build(:user_id => user)
			end
		end
	    respond_to do |format|
	      if @project.save
---
INSERT INTO `members` (`created_at`, `project_id`, `updated_at`, `user_id`) VALUES ('2014-08-24 06:24:31', 'id', '2014-08-24 06:24:31', 1)
INSERT INTO `projects` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-08-24 06:00:04', 'this is the first project', 'newProject', '2014-08-24 06:00:04')

	    def set_project
	      @project = Project.find(params[:id])
---
SELECT `projects`.* FROM `projects`  WHERE (id = SELECT `members`.`project_id` FROM `members`  WHERE (user_id = 2))