app/controllers/project_users_controller.rb

  def index
    @project_users = ProjectUser.all
---
SELECT `project_users`.* FROM `project_users`

  def create
    @project_user = ProjectUser.new(project_user_params)

    respond_to do |format|
      if @project_user.save
---
INSERT INTO `project_users` (`avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('image/jpeg', 'images.jpeg', 1362, '2014-08-21 17:02:53', '2014-08-21 17:02:53', '2014-08-21 17:02:53')

    def set_project_user
      @project_user = ProjectUser.find(params[:id])
---
SELECT  `project_users`.* FROM `project_users`  WHERE `project_users`.`id` = 1 LIMIT 1