app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    @current_user_story = UserStory.find(params[:task][:user_story_id])
    @current_user_story.tasks << @task
---
SELECT  `user_stories`.* FROM `user_stories`  WHERE `user_stories`.`id` = 1 LIMIT 1
INSERT INTO `tasks` (`created_at`, `description`, `name`, `state`, `updated_at`, `user_story_id`) VALUES ('2014-08-24 12:02:35', 'first task', 'first task', 'done', '2014-08-24 12:02:35', 1)

    def set_task
      @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks`  WHERE `tasks`.`id` = 1 LIMIT 1