app/controllers/user_stories_controller.rb

SELECT `user_stories`.* FROM `user_stories`
---
  def index
    @user_stories = UserStory.all

SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `members`.* FROM `members`  WHERE `members`.`project_id` = 1
---
  def new
    #TODO project.user_story.new
    @user_story = UserStory.new
    @user_story.project_id = params[:project_id]
    @user_ids=Member.select(:user_id).where(project_id: @user_story.project_id)
    @users=User.where("id IN (?)",@user_ids)

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @user_ids=UserStoryMember.select(:user_id).where(user_story_id: @user_story.id)
    @users=User.where("id NOT IN (?)" , @user_ids)

SELECT  `projects`.* FROM `projects`  WHERE `projects`.`id` = 1 LIMIT 1
INSERT INTO `user_stories` (`created_at`, `descp`, `name`, `project_id`, `state`, `updated_at`) VALUES ('2014-08-24 10:01:23', 'that is first story in the first project', 'first story', 1, 'done', '2014-08-24 10:01:23')
---
  def create
    @user_story = UserStory.new(user_story_params)
    params[:user][:id].each do |user|
      if !user.empty?
        @user_story.user_story_members.build(:user_id => user)
      end
    end
    @current_project = Project.find_by_id(params[:user_story][:project_id])
    @current_project.user_stories << @user_story

SELECT  `user_stories`.* FROM `user_stories`  WHERE `user_stories`.`id` = 1 LIMIT 1
---
    def set_user_story
      @user_story = UserStory.find(params[:id])