app/controllers/users_controller.rb

  def create
    # puts user_params
    @user = User.new(user_params)
    # @user = User.create( user_params )

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('image/jpeg', 'images.jpeg', 1362, '2014-08-21 14:26:49', '2014-08-21 14:26:49', '2014-08-21 14:26:49')